Function Reference

# Object Attributes

| | | |
|---|---|---|
| AddSubMtrlToMtrl | CountFillSpaces | CreateFillSpace |
| CreateMaterial | EnableDropShadow | ExcludeFromDataVis |
| GetClass | GetDescriptionText | GetDropShadowByCls |
| GetDropShadowData | GetEntityMatrix | GetFillBack |
| GetFillFore | GetFillIAxisEndPoint | GetFillJAxisEndPoint |
| GetFillOriginPoint | GetFillPoints | GetFillSpace |
| GetFPat | GetLS <sub>*obsolete in Vectorworks 2013*</sub> | GetLSN |
| GetLW | GetMarker <sub>*obsolete in VectorWorks 2008*</sub> | GetMaterialArea |
| GetMaterialFillStyle | GetMaterialTexture | GetMaterialVolume |
| GetMtlFillBackColor | GetMtlFillForeColor | GetMtlPenBackColor <sub>*obsolete in Vectorworks 2022*</sub> |
| GetMtlPenForeColor <sub>*obsolete in Vectorworks 2022*</sub> | GetObjArrow <sub>*obsolete in VectorWorks 2008*</sub> | GetObjBeginningMarker |
| GetObjEndMarker | GetObjMaterialHandle | GetObjMaterialName |
| GetObjTypeProperties | GetOpacity | GetOpacityByClass |
| GetOpacityByClassN | GetOpacityN | GetPenBack |
| GetPenFore | GetViewMatrix | HideSelectedObjects |
| IsDropShadowEnabled | IsFillColorByClass | IsFPatByClass |
| IsLSByClass | IsLWByClass | IsMarkerByClass |
| IsMaterialSimple | IsMtrlFillStyleByCls | IsObjectFlipped |
| IsPenColorByClass | IsPlanarObj | IsTextStyleByClass |
| RemoveSubMtrlFromMtl | SetClass | SetClassN |
| SetDescriptionText | SetDropShadowByCls | SetDropShadowData |
| SetEntityMatrix | SetEntityMatrixN | SetFillBack |
| SetFillColorByClass | SetFillFore | SetFillIAxisEndPoint |
| SetFillJAxisEndPoint | SetFillOriginPoint | SetFPat |
| SetFPatByClass | SetLS <sub>*obsolete in Vectorworks 2013*</sub> | SetLSByClass |
| SetLSN | SetLW | SetLWByClass |
| SetMarker <sub>*obsolete in VectorWorks 2008*</sub> | SetMarkerByClass | SetMaterialFillStyle |
| SetMaterialTexture | SetMtlFillBackColor | SetMtlFillForeColor |
| SetMtlFillStyleByCls | SetMtlPenBackColor <sub>*obsolete in Vectorworks 2022*</sub> | SetMtlPenForeColor <sub>*obsolete in Vectorworks 2022*</sub> |
| SetObjArrow <sub>*obsolete in VectorWorks 2008*</sub> | SetObjBeginningMarker | SetObjEndMarker |
| SetObjMaterialHandle | SetOpacity | SetOpacityByClass |
| SetOpacityByClassN | SetOpacityN | SetPenBack |
| SetPenColorByClass | SetPenFore | SetTextStyleByClass |
| SetViewMatrix | ShowOnlySelected | UnHideObjects |
| UpdateSubMtrlInMtrl | UpdateThumbnailPreview